; (NB!) Формат комментариев: Коментарий по-русски (Comment in english)
; UTF-16 LЕ with ВОМ

[Variables]
_Name=OmniCal
_Version=v3.5

; Выбор ЯЗЫКа интерфейса  (Language choice of the interface):
    ; Варианты (Options): RU, EN
    Language=RU

    ;—— ПОДПИСИ (Labels) ————————————————————————————————————————————————————————————————————————————————
    Version_txt_RU=#_Name# #_Version#
    Version_txt_EN=OmniCal #_Version#

    CurentTime_RU="Текущее время"
    CurentTime_EN="Current time"

    HighlightToday_RU="Выделить Сегодня"
    HighlightToday_EN="Highlight Today"

    DateinToday_txt_RU="Дата в Сегодня"
    DateinToday_txt_EN="Date in Today"

    TimeZone_1_RU="Зоны времени"
    TimeZone_1_EN="Time Zones"

    TimeSeparator_1_txt_RU="Разделители"
    TimeSeparator_1_txt_EN="Time Separators"

    Weekend_txt_RU="Выходные"
    Weekend_txt_EN="Weekend"
    
    Weekend_Days1_txt_RU=Пн
    Weekend_Days1_txt_EN=Mo
    Weekend_Days2_txt_RU=Вт
    Weekend_Days2_txt_EN=Tu
    Weekend_Days3_txt_RU=Ср
    Weekend_Days3_txt_EN=We
    Weekend_Days4_txt_RU=Чт
    Weekend_Days4_txt_EN=Th
    Weekend_Days5_txt_RU=Пт
    Weekend_Days5_txt_EN=Fr
    Weekend_Days6_txt_RU=Сб
    Weekend_Days6_txt_EN=Sa
    Weekend_Days7_txt_RU=Вс
    Weekend_Days7_txt_EN=Su

    WeekendSeparetor_txt_RU="Начало недели"
    WeekendSeparetor_txt_EN="Week start highlight"

    StepGrid_txt_RU="Шаг сетки#CRLF#(высота получаса)"
    StepGrid_txt_EN="Half-hour height#CRLF#(Step of the grid)"

    DisplayedDays_txt_RU="Количество дней#CRLF#( 1 - 14 )"
    DisplayedDays_txt_EN="Number of days#CRLF#( 1 - 14 )"

    ToDay_Width_txt_RU="Сегодня"
    ToDay_Width_txt_EN="Today"

    OthersDay_Width_txt_RU="Остальные"
    OthersDay_Width_txt_EN="Other"

    _Author=⊰SK⊱
    _Information_RU=Отображает предстоящие события из ваших Google или iCloud Календарей.    Этот скин является адаптированной модификацией оригинального патча от eclectic-tech (на основе Enigma GCal от Kaelri).
    _Information_EN=Displays upcoming events from your Google or iCloud Calendars.    This skin is an adapted modification of the original patch by eclectic-tech (based on Enigma GCal by Kaelri).


    ThemeDark_RU=Тёмная
    ThemeDark_EN=Dark
    ThemeLight_RU=Светлая
    ThemeLight_EN=Light

    Str_Theme_RU=Тема оформления:
    Str_Theme_EN=Theme:

    Str_Theme_mode_RU=[#Theme[#Theme]_[#Language]]
    Str_Theme_mode_EN=[#Theme[#Theme]_[#Language]]
    
    Str_Theme_mode_Tooltips_RU=Сменить тему оформления (Тёмная/Светлая) 
    Str_Theme_mode_Tooltips_EN=Switch theme (Dark/Light)


    Str_Event_RU=| Событие
    Str_Event_EN=| Event


    Str_Embedded_RU=| Встроенный цвет
    Str_Embedded_EN=| Embedded color

    Str_EventFaded_RU=Прошедшее
    Str_EventFaded_EN=Past

    Str_Cal_1_Event_BG_RU=Цвет фона События для 1-го календаря
    Str_Cal_1_Event_BG_EN=Color of Event background for the 1st calendar
    Str_Cal_2_Event_BG_RU=Цвет фона События для 2-го календаря
    Str_Cal_2_Event_BG_EN=Color of Event background for the 2st calendar
    Str_Cal_3_Event_BG_RU=Цвет фона События для 3-го календаря
    Str_Cal_3_Event_BG_EN=Color of Event background for the 3st calendar
    Str_Cal_4_Event_BG_RU=Цвет фона События для 4-го календаря
    Str_Cal_4_Event_BG_EN=Color of Event background for the 4st calendar
    Str_Cal_5_Event_BG_RU=Цвет фона События для 5-го календаря
    Str_Cal_5_Event_BG_EN=Color of Event background for the 5st calendar


    Str_Cal_1_Event_Tooltips_RU=Цвет текста События для 1-го календаря
    Str_Cal_1_Event_Tooltips_EN=Color of Event text for the 1st calendar
    Str_Cal_2_Event_Tooltips_RU=Цвет текста События для 2-го календаря
    Str_Cal_2_Event_Tooltips_EN=Color of Event text for the 2st calendar
    Str_Cal_3_Event_Tooltips_RU=Цвет текста События для 3-го календаря
    Str_Cal_3_Event_Tooltips_EN=Color of Event text for the 3st calendar
    Str_Cal_4_Event_Tooltips_RU=Цвет текста События для 4-го календаря
    Str_Cal_4_Event_Tooltips_EN=Color of Event text for the 4st calendar
    Str_Cal_5_Event_Tooltips_RU=Цвет текста События для 5-го календаря
    Str_Cal_5_Event_Tooltips_EN=Color of Event text for the 5st calendar

    Str_Cal_1_FontSizeEvent_Tooltips_RU=Размер шрифта: События 
    Str_Cal_1_FontSizeEvent_Tooltips_EN=Font size of Event
    Str_Cal_1_FontSizeEventFaded_Tooltips_RU=прошедшего События
    Str_Cal_1_FontSizeEventFaded_Tooltips_EN=Font size of Past Event

    Str_Embedded_Tooltips_RU=Поддержка встроенного цвета события (вкл/выкл)
    Str_Embedded_Tooltips_EN=Support for embedded event color (on/off)

    Str_Cal_1_EventFaded_Tooltips_RU=Прошедшее Событие: Цвет фона ←|→ Цвет текста для 1-го календаря
    Str_Cal_1_EventFaded_Tooltips_EN=Past Event: Background Color ←|→ Text Color for the 1st calendar
    Str_Cal_2_EventFaded_Tooltips_RU=Прошедшее Событие: Цвет фона ←|→ Цвет текста для 2-го календаря
    Str_Cal_2_EventFaded_Tooltips_EN=Past Event: Background Color ←|→ Text Color for the 2nd calendar
    Str_Cal_3_EventFaded_Tooltips_RU=Прошедшее Событие: Цвет фона ←|→ Цвет текста для 3-го календаря
    Str_Cal_3_EventFaded_Tooltips_EN=Past Event: Background Color ←|→ Text Color for the 3rd calendar
    Str_Cal_4_EventFaded_Tooltips_RU=Прошедшее Событие: Цвет фона ←|→ Цвет текста для 4-го календаря
    Str_Cal_4_EventFaded_Tooltips_EN=Past Event: Background Color ←|→ Text Color for the 4th calendar
    Str_Cal_5_EventFaded_Tooltips_RU=Прошедшее Событие: Цвет фона ←|→ Цвет текста для 5-го календаря
    Str_Cal_5_EventFaded_Tooltips_EN=Past Event: Background Color ←|→ Text Color for the 5th calendar



    Str_HourLine_RU=Линия часа
    Str_HourLine_EN=Hour line

    Str_HalfHourLine_RU=Линия получаса
    Str_HalfHourLine_EN=Half-hour line


    Str_HeaderLine_RU=Линия заголовка
    Str_HeaderLine_EN=Header line
    
    Str_HourLine_Tooltips_RU=Цвет линии часа
    Str_HourLine_Tooltips_EN=Color of hour line
    
    Str_HalfHourLine_Tooltips_RU=Цвет линии получаса
    Str_HalfHourLine_Tooltips_EN=Color of half-hour line
    
    Str_HeaderLine_Tooltips_RU=Цвет линии заголовка
    Str_HeaderLine_Tooltips_EN=Color of header line

    Str_VerticalLines_RU=Вертикальные линии
    Str_VerticalLines_EN=HeadVerticaler line
    
    Str_VerticalLines_Tooltips_RU=Цвет вертикальных линий
    Str_VerticalLines_Tooltips_EN=Color of vertical lines


    Str_Header_RU=Заголовок
    Str_Header_EN=Header
    
    Str_Header_Tooltips_RU=Цвет текста заголовка
    Str_Header_Tooltips_EN=Color of header text

    Str_HeaderWeekend_RU=Выходные
    Str_HeaderWeekend_EN=Weekend
    
    Str_HeaderWeekend_Tooltips_RU=Цвет текста заголовка для выходных
    Str_HeaderWeekend_Tooltips_EN=Color of header text for weekends


    Str_TimeLabels_RU=Время
    Str_TimeLabels_EN=Time
    
    Str_TimeLabels_Tooltips_RU=Цвет подписей времени
    Str_TimeLabels_Tooltips_EN=Color of time labels

    Str_CurrentTime_RU=Текущее время
    Str_CurrentTime_EN=Current time
    
    Str_CurrentTime_Tooltips_RU=Цвет линии текущего времени
    Str_CurrentTime_Tooltips_EN=Color of current time line


    Str_Separator1_RU=Разделитель 1
    Str_Separator1_EN=Separator 1
    
    Str_Separator1_Tooltips_RU=Цвет разделителя 1
    Str_Separator1_Tooltips_EN=Color of separator 1

    Str_Separator2_RU=Разделитель 2
    Str_Separator2_EN=Separator 2
    
    Str_Separator2_Tooltips_RU=Цвет разделителя 2
    Str_Separator2_Tooltips_EN=Color of separator 2


    Str_TimeZone1_RU=Зона времени 1
    Str_TimeZone1_EN=Time Zone 1
    Str_TimeZone1_Tooltips_RU=Цвет для Зона времени 1
    Str_TimeZone1_Tooltips_EN=Color for Time Zone 1

    Str_TimeZone2_RU=Зона времени 2
    Str_TimeZone2_EN=Time Zone 2
    Str_TimeZone2_Tooltips_RU=Цвет для Зона времени 2
    Str_TimeZone2_Tooltips_EN=Color for Time Zone 2


    Str_TimeZone3_RU=Зона времени 3
    Str_TimeZone3_EN=Time Zone 3
    Str_TimeZone3_Tooltips_RU=Цвет для Зона времени 3
    Str_TimeZone3_Tooltips_EN=Color for Time Zone 3

    Str_GridBackground_RU=ФОН 
    Str_GridBackground_EN=BACKGROUND
    Str_GridBackground_Tooltips_RU=Основной фон скина
    Str_GridBackground_Tooltips_EN=Main background of the skin

    Str_FontSizeEvent_Tooltips_RU=Размер шрифта для текущих и будущих событий (6-20)
    Str_FontSizeEvent_Tooltips_EN=Font size for current and future events (6-20)
    Str_FontSizeEventFaded_Tooltips_RU=Размер шрифта для прошедших событий (6-20)
    Str_FontSizeEventFaded_Tooltips_EN=Font size for past events (6-20)

    Str_ThemeSettingsButton_Tooltips_RU=Открыть: Файл темы ←|→ Папка скина
    Str_ThemeSettingsButton_Tooltips_EN=Open: Current Theme file ←|→ Skin folder

    Str_ResetThemeButton_Tooltips_RU=Сбросить текущую тему оформления к настройкам по умолчанию
    Str_ResetThemeButton_Tooltips_EN=Reset current theme to default settings

    Str_ResetThemeSuccess_RU=✓ Тема успешно сброшена к настройкам по умолчанию
    Str_ResetThemeSuccess_EN=✓ Theme successfully reset to default settings

    Str_ResetThemeError_RU=✗ Ошибка при сбросе темы. Проверьте логи.
    Str_ResetThemeError_EN=✗ Error resetting theme. Check logs.

;—— ТЕМА ОФОРМЛЕНИЯ (Theme) ————————————————————————————————————————————————————————————————————————
    ; Выбор темы оформления (Theme choice)
    ; Варианты (Options): Dark, Light
    Theme=Dark


;—— ЗАГОЛОВКИ (Title) ——————————————————————————————————————————————————————————————————————
    ; Дата в Сегодня (Date in Today):
    ; Варианты (Options): 1, 0
    DateinToday=0
    DateinToday2=1

;—— РЕЖИМЫ ОТОБРАЖЕНИЯ (Display modes) —————————————————————————————————————————————————————————————
    ; TODO 
    ; Варианты (Options): 1-14
    DisplayedDays=3
    
    ; ; Минимальный режим ВКЛ/ВЫКЛ (SmallMode ON/OFF):
    ;     ; Варианты (Options): 1, 0
    ;     SmallMode=1
    ;     ; Количество дней в SmallMode (Number of days in SmallMode):
    ;     ; Варианты (Options): 1, 2, 3, ... макс:7
    ;     SmallModeDays=3

    ; ; Расширенный режим ВКЛ/ВЫКЛ (LagreMode ON/OFF):
    ;     ; Варианты (Options): 1, 0
    ;     LagreMode=0
    ;     ; Количество дней в LagreMode (Number of days in LagreMode):
    ;     ; Варианты (Options): 1, 2, 3, ... макс:14
    ;     LagreModeDays=10

;—— СЕТКА ВРЕМЕНИ (Time grid) ——————————————————————————————————————————————————————————————————————
    ; Выделить "Сегодня" (Highlight "Today"):
    ; Варианты (Options): 1-да(on), 0-нет(off)
    HighlightToday=0

    ; Ширина блока СЕГОДНЯ календаря в пикселях (Width of TODAY calendar block in pixels):
    ; Переменная BlockWidth_0 обновляется автоматически и зависит от todayHighlightWidth (см. ниже) (The variable BlockWidth_0 is updated automatically and depends on todayHighlightWidth (see below))
    BlockWidth_0=150
    ; На сколько шире столбик Сегодня относительно остальных (How much wider the Today column is compared to the others):
    todayHighlightWidth=50

    ; Ширина одного блока (дня) календаря в пикселях (Width of one calendar block(day) in pixels):
    BlockWidth=100

    ; Ширина всей сетки (3 календаря) в пикселях (Width of the entire grid (3 calendars) in pixels):
    ; НЕ МЕНЯТЬ ВРУЧНУЮ! (DO NOT CHANGE MANUALLY!)
    LineWidth=(#BlockWidth_0#+(#BlockWidth#*(#DisplayedDays#-1)))

    ; С какого часа начинаются СУТКИ в `психологическом` режиме (From which hour the DAY starts in `psychological` mode):
    ; ВАЖНО: Используется ТОЛЬКО когда startHour > endHour (психологический режим) (IMPORTANT: Used ONLY when startHour > endHour (psychological mode))
    ; В `нормальном` режиме (startHour < endHour) сутки всегда 00:00-00:00, DayStartHour игнорируется (In `normal` mode (startHour < endHour), the day is always 00:00-00:00, DayStartHour is ignored)
    ; В `психологическом` режиме (startHour > endHour) сутки начинаются с этого часа (In `psychological` mode (startHour > endHour), the day starts from this hour)
    ; Если не задано в психологическом режиме, используется startHour (If not set in psychological mode, startHour is used)
    ; Формат (Format): 0-23
    DayStartHour=5

    ; С какого часа строить сетку времени (From which hour to build the time grid):
    startHour=9
    ; По какой час строить сетку (до какого часа) (Until which hour to build the grid (up to which hour)):
    endHour=6

    ; Отступ слева для сетки времени (Left margin for the time grid): TODO Лишняя переменная???
    LeftMargin=45

    ;  Отступ слева для подписей времени (Left margin for time labels):
    LeftMarginTxt=10

    ; Отступ слева для сетки времени (Left margin for the time grid):
    LeftMargin=#LeftMarginTxt#+10

    ;  Высота заголовка с днями недели в пикселях (Height of the header with days of the week in pixels):
    StepGrid_0=35

    ; Размер шрифта для заголовка с днями недели (Font size for the header with days of the week):
    FontSizeTitle=10

    ; Размер шрифта для подписей времени (Font size for time labels):
    GridHourFontSize=8
    GridHourFontSize1=7

    ; Высота одного получаса в пикселях (Height of one half-hour in pixels):
    StepGrid=17

    ; Боковая Правая вертикальная линия. Видимость (Right side vertical line. Visibility):
    ; Варианты (Options): 1-вкл(on), 0-выкл(off)
    VerticalLine_End_Hidden=1



;—— ФОН ДЛЯ ДНЕВНОГО ВРЕМЕНИ TimeZone_1 В СУТКАХ (Background for daytime hours TimeZone_1) ———————————————————————————————
    ; Включить выделение TimeZone_1 в сутках (Enable highlighting of TimeZone_1 hours):
    ; Варианты (Options): 1, 0
    TimeZone_1=1
    ; С какого часа начинать выделение TimeZone_1 времени в сутках (From which hour to start highlighting daytime hours):
    ; Формат (Format): Ч (H); 0Ч (0H); ЧЧ (HH); ЧЧ:ММ (HH:MM); ЧЧ,ММ (HH,MM); ЧЧ.ММ (HH.MM); ЧЧ-ММ (HH-MM);
    TimeZone_1_Start=10
    TimeZone_1_End=21

    ;—— ФОН ДЛЯ ДНЕВНОГО ВРЕМЕНИ TimeZone_2 В СУТКАХ (Background for daytime hours TimeZone_2) ———————————————————————————————
    ; Включить выделение TimeZone_2 в сутках (Enable highlighting of TimeZone_2 hours):
    ; Варианты (Options): 1, 0
    TimeZone_2=1
    ; С какого часа начинать выделение TimeZone_2 времени в сутках (From which hour to start highlighting daytime hours):
    ; Формат (Format): Ч (H); 0Ч (0H); ЧЧ (HH); ЧЧ:ММ (HH:MM); ЧЧ,ММ (HH,MM); ЧЧ.ММ (HH.MM); ЧЧ-ММ (HH-MM);
    TimeZone_2_Start=13
    TimeZone_2_End=15:30

    ;—— ФОН ДЛЯ ДНЕВНОГО ВРЕМЕНИ TimeZone_3 В СУТКАХ (Background for daytime hours TimeZone_3) ———————————————————————————————
    ; Включить выделение TimeZone_3 в сутках (Enable highlighting of TimeZone_3 hours):
    ; Варианты (Options): 1, 0
    TimeZone_3=1
    ; С какого часа начинать выделение TimeZone_2 времени в сутках (From which hour to start highlighting daytime hours):
    ; Формат (Format): Ч (H); 0Ч (0H); ЧЧ (HH); ЧЧ:ММ (HH:MM); ЧЧ,ММ (HH,MM); ЧЧ.ММ (HH.MM); ЧЧ-ММ (HH-MM);
    TimeZone_3_Start=23
    TimeZone_3_End=4

; —— РАЗДЕЛИТЕЛИ (Separators) ——————————————————————————————————————————————————————————————————————
    ; Разделитель 1 Показать/скрыть (Show/hide Separator 1)
    ; Варианты (Options): 1-Показать, 0-скрыть (1-Show, 0-Hide)
    Separator_1=1
    ; Толщина разделителя 1 (Separator 1 thickness):
    Separator_1_Weight=4
    ; Время для разделителя 1 (Time for Separator 1):
    Separator_1_Time=12

    ; Разделитель 2 Показать/скрыть (Show/hide Separator 2)
    ; Варианты (Options): 1-Показать, 0-скрыть (1-Show, 0-Hide)
    Separator_2=1
    ; Толщина разделителя 2 (Separator 2 thickness):
    Separator_2_Weight=4
    ; Время для разделителя 2 (Time for Separator 2):
    Separator_2_Time=0

    ; Режим ширины разделителей (Separator width mode):
    ; Варианты (Options): 0-короткая (short, today only), 1-длинная (long, full grid)
    Separator_1_WidthMode=1
    Separator_2_WidthMode=1

    ; Параметры анимации изменения ширины сепараторов (Separator width animation parameters):
    ; Интервал между кадрами в миллисекундах (Interval between frames in milliseconds):
    ; Рекомендуется 16-20мс для плавной анимации без тормозов (Recommended 16-20ms for smooth animation without lags)
    SeparatorAnimationInterval=15
    ; Количество кадров анимации (Number of animation frames):
    ; Меньше кадров = меньше нагрузка на CPU (Fewer frames = less CPU load)
    ; Продолжительность = Interval × Frames (Duration = Interval × Frames)
    SeparatorAnimationFrames=50

    ; Переменные для анимации ширины сепараторов (Variables for separator width animation):
    ; НЕ МЕНЯТЬ ВРУЧНУЮ! Управляются скриптом (DO NOT CHANGE MANUALLY! Managed by script)
    Separator_1_CurrentWidth=0
    Separator_1_WidthStep=0
    Separator_1_WidthMin=0
    Separator_1_WidthMax=0
    Separator_2_CurrentWidth=0
    Separator_2_WidthStep=0
    Separator_2_WidthMin=0
    Separator_2_WidthMax=0


; ВЫХОДНЫЕ (Weekend) ————————————————————————————————————————————————————————————————————————————————
    ; Выделить выходные (Highlight weekend):
    ; Варианты (Options): 1-выделить(Highlight), 0-не выделять(No highlight)
    Weekend_Sun=1
    Weekend_Mon=0
    Weekend_Tue=0
    Weekend_Wed=0
    Weekend_Thu=0
    Weekend_Fri=0
    Weekend_Sat=1
    ; Выделить заголовок (Highlight header)
    Weekend_HighlightHeader=0
    ; Выделить подзаголовок (Highlight subheader)
    Weekend_HighlightSubHeader=1
    ; Толщина шрифта для подзаголовков выходных (Font weight for weekend subheaders):
    FontWeight_SubHeader=600
    Weekend_FontWeight_HighlightSubHeader=600

    ; Разделитель начала недели (Week start separator):
    ; Варианты (Options): 1-Показать(Show), 0-Скрыть(Hide)
    Separator_Mon=1
    Separator_Tue=0
    Separator_Wed=0
    Separator_Thu=0
    Separator_Fri=0
    Separator_Sat=0
    Separator_Sun=0


; —— ПОДДЕРЖКА ВСТРОЕНННОГО ЦВЕТА ФОНА СОБЫТИЯ ИЗ ВНЕШНЕГО ИСТОЧНИКА (Apply embedded background color for event from external source) ———————————————
    ;(некоторые программы поддерживают синхронизацию кастомного цвета события, например WeecCal, передают его в поле "Заметки" или DESCRIPTION:[!FFFFC0!]) 
    ;((some programs support syncing custom event color, e.g. WeecCal, pass it in the "Notes" field or DESCRIPTION:[!FFFFC0!]))
    ; Варианты (Options): 1, 0
    applyEmbeddedBGcolorCal_1=1
    applyEmbeddedBGcolorCal_2=1
    applyEmbeddedBGcolorCal_3=1
    applyEmbeddedBGcolorCal_4=0
    applyEmbeddedBGcolorCal_5=0




;—— СОБЫТИЕ (Event) ————————————————————————————————————————————————————————————————————————————————
    ; Внешний вид события (Event appearance):
    ; Размер шрифта для событий (Font size for events):
    ; (только целые числа) (only integers)
    FontSizeEvent=7
    ; Толщина шрифта для событий (Font weight for events):
    FontWeightEvens=600
    ; Шрифт для событий (Font for events):
    FontName=Montserrat
    FontUnicode=Arial
    
    ; Размер шрифта для прошедших событий (Font size for past events):
    ; (только целые числа) (only integers)
    FontSizeEvent_Faded=7

    ; Отступы текста внутри события (Text padding inside event):
    ; Верхний отступ текста от края события (Top padding of text from event edge):
    EventTextPaddingTop=3
    ; Левый отступ текста от края события (Left padding of text from event edge):
    EventTextPaddingLeft=4
    ; Правый отступ текста от края события (Right padding of text from event edge):
    EventTextPaddingRight=3
    ; Нижний отступ текста от края события (Bottom padding of text from event edge):
    EventTextPaddingBottom=2

    ; Unicode символ повторяющегося события (Unicode symbol for recurring event):
    ; ↶ ↷ ↺ ↻ ⟲ ⟳ ♻ ⤺ ⤻ ⤼ ⤽ ⤾ ⤿ ⥀ ⥁ ⌘ ⇄ ⇅ ⇆ ⥂ ⥃ ⥄ ⥅ ๑ ஐ ⊶ ⊷
    RepeatEventIcon=↻

    ; Приглушенный цвет для событий ЗАВТРА и далее (Muted color for events for tomorrow and beyond):
    ; Варианты (Options): 0-выкл(off) 1-вкл rgb→A(on rgb→A), 2-вкл hS→L(on hS→L),
    MutedFutureEvents=0
    ; Прозрачность приглушенного цвета для событий ЗАВТРА и далее (Transparency of the muted color for events for tomorrow and beyond):
    ; На сколько цвет будет более прозрачным (How much more transparent the color will be):
        ; →A:(0-255) 0 - полностью прозрачно (completely transparent), 255 - непрозрачно (opaque)
        ; рекомендуется от 10 до 90 (recommended from 10 to 90)
        Muted_rgbA=80
        ; →L: в % (0-100) на сколько % уменьшить яркость и насыщенность (by what % to reduce brightness and saturation)
        ; рекомендуется от 10 до 50 (recommended from 10 to 50)
        Muted_hSL=35

;—— ПУТЬ К ПОЧТОВОМУ КЛИЕНТУ (Path to mail client) —————————————————————————————————————————————————————————————
    ; для открытия Календаря при клике на событие для управления событиями (to open the Calendar for managing events):
    ; Укажите путь к вашему почтовому клиенту (Specify the path to your mail
    CalendarClient="C:\Program Files (x86)\eM Client\MailClient.exe"

;—— КНОПКИ КАЛЕНДАРЕЙ слева вверху сетки (Calendar buttons at the top left of the grid) ————————————
    EllipseRad1=3
    EllipseRad2=3
    EllipseRad3=3
    EllipseRad4=3
    EllipseScale=2
    Rectangle4W=6
    Rectangle4H=6
    Rectangle5W=6
    Rectangle5H=6
    Rectangle6W=6
    Rectangle6H=6
    RectangleScale=2
    Cal_4_OffsetX=0
    Cal_4_OffsetY=0
    Cal_5_OffsetX=0
    Cal_5_OffsetY=0
    Cal_6_OffsetX=0
    Cal_6_OffsetY=0


;—— КНОПКА и ПАНЕЛЬ НАСТРОЕК (Settings button and Settings panel) —————————————————————————————————————————————————————————————
    SettingsFontFace=Font Awesome 7 Free Solid
    SettingsHidden=0
    SettingsOnHidden=1
    Settings_Txt_RU=Настройки ←|→ Обновить
    Settings_Txt_EN=Settings ←|→ Refresh

    ; Таймаут автоматического отключения режима настроек в секундах (Settings mode auto-disable timeout in seconds)
    SettingsTimeoutSeconds=60

    MeLink="https://github.com/Dokcc"

    ; Размер панели настроек (Settings panel size):
    SettingsPanel_W=237
    SettingsPanel_H=400
    SettingsPanel_X=(#LeftMargin#+#LineWidth#-#SettingsPanel_W#-10)
    ; Положение текста в панели настроек (Text position in the settings panel):
    SettingsPanel_txt_X=(#SettingsPanel_X#+16)
    SettingsPanel_Col_Step=27
    SettingsPanel_Centr_X=(#SettingsPanel_X#+(#SettingsPanel_W#/2))
    SettingsPanel_Col_1_X=(#SettingsPanel_txt_X#+127)
    SettingsPanel_Col_2_X=(#SettingsPanel_Col_1_X#+#SettingsPanel_Col_Step#)
    SettingsPanel_Col_3_X=(#SettingsPanel_Col_2_X#+#SettingsPanel_Col_Step#)
    WDT_step=31
    WB_Step=10
    WSB_Step=21
    Day_Width_Input_Rect_W=((#SettingsPanel_Centr_X#-19)-#SettingsPanel_txt_X#)


    ; Подсказки панели настроек (Settings panel tooltips):
    SPtooltips_Version_RU=Перейти на страницу скина
    SPtooltips_Version_EN=Go to skin page
    
    SPtooltips_CalendarSettingsBtn_RU=Открыть: Файл настроек календарей
    SPtooltips_CalendarSettingsBtn_EN=Open: Calendar Settings file

    ; SPtooltips_OtherSettingsBtn_RU=Открыть: Настройки ←|→ Папку скина
    SPtooltips_OtherSettingsBtn_RU=Variables.ini ←|→ Папка скина
    SPtooltips_OtherSettingsBtn_EN=Open: Variables.ini ←|→ Skin folder


    SPtooltips_LangButton_RU=Сменить язык интерфейса
    SPtooltips_LangButton_EN=Change interface language
    SPtooltips_ThemeButton_RU=Сменить тему ←|→ Настроить
    SPtooltips_ThemeButton_EN=Change theme ←|→ Customize

    SPtooltips_DateinToday1_RU=Дата в подзаголовке
    SPtooltips_DateinToday1_EN=Date in subheader
    SPtooltips_DateinToday2_RU=Дата в заголовке
    SPtooltips_DateinToday2_EN=Date in header

    SPtooltips_HighlightToday_RU=Акцент на Сегодня
    SPtooltips_HighlightToday_EN=Highlight Today

    SPtooltips_CurentTimeL_RU=Показать слева
    SPtooltips_CurentTimeL_EN=Show on the left

    SPtooltips_CurentTimeR_RU=Показать справа
    SPtooltips_CurentTimeR_EN=Show on the right

    SPtooltips_TimeZone_1_RU=Зона времени 1 (вкл/выкл)
    SPtooltips_TimeZone_1_EN=Time Zone 1 (on/off)
    SPtooltips_TimeZone_2_RU=Зона времени 2 (вкл/выкл)
    SPtooltips_TimeZone_2_EN=Time Zone 2 (on/off)
    SPtooltips_TimeZone_3_RU=Зона времени 3 (вкл/выкл)
    SPtooltips_TimeZone_3_EN=Time Zone 3 (on/off)

    SPtooltips_TimeSeparator_1_RU=Разделитель 1 (вкл/выкл)
    SPtooltips_TimeSeparator_1_EN=Separator 1 (on/off)
    SPtooltips_TimeSeparator_2_RU=Разделитель 2 (вкл/выкл)
    SPtooltips_TimeSeparator_2_EN=Separator 2 (on/off)

    ; Тултипы для кликабельных разделителей (Tooltips for clickable separators)
    Separator_1_Tooltip_RU=Клик: Переключить ширину разделителя
    Separator_1_Tooltip_EN=Click: Toggle separator width
    Separator_2_Tooltip_RU=Клик: Переключить ширину разделителя
    Separator_2_Tooltip_EN=Click: Toggle separator width

    SPtooltips_Weekend_Header_RU=Выходные в заголовке (вкл/выкл)
    SPtooltips_Weekend_Header_EN=Weekend in header (on/off)
    SPtooltips_Weekend_SubHeader_RU=Выходные в подзаголовке (вкл/выкл)
    SPtooltips_Weekend_SubHeader_EN=Weekend in subheader (on/off)

    SPtooltips_WeekendSeparetor_1_RU=Линия перед Пн (вкл/выкл)
    SPtooltips_WeekendSeparetor_1_EN=Line before Mon (on/off)
    SPtooltips_WeekendSeparetor_2_RU=Линия перед Вт (вкл/выкл)
    SPtooltips_WeekendSeparetor_2_EN=Line before Tue (on/off)
    SPtooltips_WeekendSeparetor_3_RU=Линия перед Ср (вкл/выкл)
    SPtooltips_WeekendSeparetor_3_EN=Line before Wed (on/off)
    SPtooltips_WeekendSeparetor_4_RU=Линия перед Чт (вкл/выкл)
    SPtooltips_WeekendSeparetor_4_EN=Line before Thu (on/off)
    SPtooltips_WeekendSeparetor_5_RU=Линия перед Пт (вкл/выкл)
    SPtooltips_WeekendSeparetor_5_EN=Line before Fri (on/off)
    SPtooltips_WeekendSeparetor_6_RU=Линия перед Сб (вкл/выкл)
    SPtooltips_WeekendSeparetor_6_EN=Line before Sat (on/off)
    SPtooltips_WeekendSeparetor_7_RU=Линия перед Вс (вкл/выкл)
    SPtooltips_WeekendSeparetor_7_EN=Line before Sun (on/off)

    SPtooltips_Weekend_1_RU=Выходной Пн (вкл/выкл)
    SPtooltips_Weekend_1_EN=Weekend Mon (on/off)
    SPtooltips_Weekend_2_RU=Выходной Вт (вкл/выкл)
    SPtooltips_Weekend_2_EN=Weekend Tue (on/off)
    SPtooltips_Weekend_3_RU=Выходной Ср (вкл/выкл)
    SPtooltips_Weekend_3_EN=Weekend Wed (on/off)
    SPtooltips_Weekend_4_RU=Выходной Чт (вкл/выкл)
    SPtooltips_Weekend_4_EN=Weekend Thu (on/off)
    SPtooltips_Weekend_5_RU=Выходной Пт (вкл/выкл)
    SPtooltips_Weekend_5_EN=Weekend Fri (on/off)
    SPtooltips_Weekend_6_RU=Выходной Сб (вкл/выкл)
    SPtooltips_Weekend_6_EN=Weekend Sat (on/off)
    SPtooltips_Weekend_7_RU=Выходной Вс (вкл/выкл)
    SPtooltips_Weekend_7_EN=Weekend Sun (on/off)

    SPtooltips_StepGrid_RU=Влияет на высоту сетки времени и всего скина
    SPtooltips_StepGrid_EN=Affects the height of the time grid and the entire skin

    SPtooltips_DisplayedDays_RU=Количество отображаемых дней в скине
    SPtooltips_DisplayedDays_EN=Number of displayed days in the skin

    SPtooltips_ToDay_Width_RU=Ширина столбца Сегодня
    SPtooltips_ToDay_Width_EN=Width of Today column
    SPtooltips_OthersDay_Width_RU=Ширина остальных столбцов
    SPtooltips_OthersDay_Width_EN=Width of other columns



    
;—— DEBUG Mode —————————————————————————————————————————————————————————————————————————————————————
    ; Записывать отладочную информацию в файл CalendarGRID_dump.txt (Write debug information to CalendarGRID_dump.txt)
    ; записывать отладочную информацию в файл CalendarEvents_dump.txt (Write debug information to CalendarEvents_dump.txt)
    ; Варианты (Options): 1-вкл(on), 0-выкл(off)
    DebugMode=1

; ▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
;—— АВТОМАТИЧЕСКОЕ ОБНОВЛЕНИЕ ПЕРЕМЕННЫХ (Automatic variable update) ▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂
;—— НЕ МЕНЯТЬ ВРУЧНУЮ! (DO NOT CHANGE MANUALLY!) ▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂
    ; Высота фона для подсказки скрытого события (Height of the background for the hidden event tooltip):
        HiddenEventBGHeight=20
    
    ; Цвета для кнопок календарей (Colors for calendars buttons):
        Cal_1_FillColor=33,150,243,255
        Cal_1_StrokColor=33,150,243
        Cal_2_FillColor=99,184,144,1
        Cal_2_StrokColor=99,184,144
        Cal_3_FillColor=133,50,243,1
        Cal_3_StrokColor=133,50,243
        Cal_4_FillColor=199,159,103,1
        Cal_4_StrokColor=199,159,103
        Cal_5_FillColor=103,103,103,1
        Cal_5_StrokColor=103,103,103
        Cal_6_FillColor=120,80,160,255
        Cal_6_StrokColor=120,80,160

    ;—— Текущее время (Current time) —————————————————————————————————————————————————————
        ; Отображать текущее время (Show current time):
        ; Варианты (Options): 1, 0
        CurentTimeTypeRight=0
        CurentTimeTypeLeft=0
        CurentTimeHidden=1
        ; Адаптировать цвет фона линии текущего времени под цвет фона расположенных под ним объектов 
        ; (Adapt the background color of the current time line to the background color of the objects located under it): 
        ; Варианты (Options): 1, 0
        CurentTimeColorBgAdaptive=1
        ; TODO-75 !WriteKeyValue сделать 1 раз в мин или убрать запись вообще тк это динамич переменная и достат !SetVariable
        CurentTimeColorBg=38,38,38
        ; OmniCal_Skin.lua : Toggle_CurentTimeTypeRight(),Toggle_CurentTimeTypeLeft()
        CurentTimeShape2=Rectangle 34r,0,38,32 | Fill RadialGradient Time_CurrTimeBGGradient1 | StrokeWidth 0 | Stroke Color 0,0,0,0
    
    
    ;—— MutedFutureEvents временная переменная
        MutedFutureEvents_temp=2
    ;—— MeasureActive временная переменная
        OmniCalColorActive=0
    
    ;—— Координаты основного фона скина (устанавливаются скриптом) (Main skin background coordinates, set by script)
        MeterBg_W=395
        MeterBg_H=749
    ;—— Координаты фона TimeZone_1 (устанавливаются скриптом) (TimeZone_1 background coordinates, set by script)
        MeterDayBg_Y=69
        MeterDayBg_H=374
    ;—— Координаты фона TimeZone_2 (устанавливаются скриптом) (TimeZone_2 background coordinates, set by script)
        MeterDayBg2_Y=171
        MeterDayBg2_H=85
    ;—— Координаты фона TimeZone_3 (устанавливаются скриптом) (TimeZone_3 background coordinates, set by script)
        MeterDayBg3_Y=511
        MeterDayBg3_H=170
    
    ;—— Переключатели режимов выделения начала недели (Switches for week start highlighting modes):
        Weekend_Separetor1=1
        Weekend_Separetor2=0

    ;—— Переменная паузы LUA скрипта (LUA script pause variable):
        LUApaused=0

    ;—— Координаты для TimeZone_1 (Coordinates for TimeZone_1)
    TZ_1_InpX=(#LeftMargin#+5)
    TZ_2_InpX=(#LeftMargin#+(#BlockWidth_0#/2)-15)
    TZ_3_InpX=(#LeftMargin#+(#BlockWidth_0#)-40)
